## Create a new Database in sqlite3, call it mydatabase.db

In [1]:
import sqlite3

In [2]:
%load_ext sql
%sql sqlite:///mydatabase.db

## Create a new table in the  dB we just created.

In [13]:
%%sql

CREATE TABLE exercise
    (id INTEGER PRIMARY KEY AUTOINCREMENT,
    type TEXT,
    minutes INTEGER, 
    calories INTEGER,
    heart_rate INTEGER);


INSERT INTO exercise(type, minutes, calories, heart_rate) VALUES ("biking", 30, 100, 110);
INSERT INTO exercise(type, minutes, calories, heart_rate) VALUES ("biking", 10, 30, 105);
INSERT INTO exercise(type, minutes, calories, heart_rate) VALUES ("dancing", 15, 200, 120);

SELECT * FROM exercise_logs;

 * sqlite:///mydatabase.db
Done.
1 rows affected.
1 rows affected.
1 rows affected.
(sqlite3.OperationalError) no such table: exercise_logs
[SQL: SELECT * FROM exercise_logs;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [14]:
%%sql

select * from exercise

 * sqlite:///mydatabase.db
Done.

[(1, 'biking', 30, 100, 110),
 (2, 'biking', 10, 30, 105),
 (3, 'dancing', 15, 200, 120)]

### What activity takes < 30 min and burns > 50 calories ?

In [16]:
%%sql

select * from exercise where minutes<30 and calories>50

 * sqlite:///mydatabase.db
Done.

[(3, 'dancing', 15, 200, 120)]

## Querying IN subqueries

In [18]:
%%sql

CREATE TABLE exercise_logs
    (id INTEGER PRIMARY KEY AUTOINCREMENT,
    type TEXT,
    minutes INTEGER, 
    calories INTEGER,
    heart_rate INTEGER);

INSERT INTO exercise_logs(type, minutes, calories, heart_rate) VALUES ("biking", 30, 100, 110);
INSERT INTO exercise_logs(type, minutes, calories, heart_rate) VALUES ("biking", 10, 30, 105);
INSERT INTO exercise_logs(type, minutes, calories, heart_rate) VALUES ("dancing", 15, 200, 120);
INSERT INTO exercise_logs(type, minutes, calories, heart_rate) VALUES ("tree climbing", 30, 70, 90);
INSERT INTO exercise_logs(type, minutes, calories, heart_rate) VALUES ("tree climbing", 25, 72, 80);
INSERT INTO exercise_logs(type, minutes, calories, heart_rate) VALUES ("rowing", 30, 70, 90);
INSERT INTO exercise_logs(type, minutes, calories, heart_rate) VALUES ("hiking", 60, 80, 85);

 * sqlite:///mydatabase.db
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [19]:
%%sql

select * from exercise_logs
where type IN ('biking' , 'rowing' , 'hiking')

 * sqlite:///mydatabase.db
Done.

[(1, 'biking', 30, 100, 110),
 (2, 'biking', 10, 30, 105),
 (6, 'rowing', 30, 70, 90),
 (7, 'hiking', 60, 80, 85)]

## Using BETWEEN Operator

In [30]:
%%sql

select * from exercise_logs
where minutes BETWEEN 20 AND 150

 * sqlite:///mydatabase.db
Done.

[(1, 'biking', 30, 100, 110),
 (4, 'tree climbing', 30, 70, 90),
 (5, 'tree climbing', 25, 72, 80),
 (6, 'rowing', 30, 70, 90),
 (7, 'hiking', 60, 80, 85)]

## Using 'LIKE' operator

In [26]:
%%sql

select * from exercise_logs
where type LIKE '%clim%'

 * sqlite:///mydatabase.db
Done.

[(4, 'tree climbing', 30, 70, 90), (5, 'tree climbing', 25, 72, 80)]

## Using Having operator

In [46]:
%%sql

select type, count(type) as Count_type
from exercise_logs

group by type

 * sqlite:///mydatabase.db
Done.

[('biking', 2),
 ('dancing', 1),
 ('hiking', 1),
 ('rowing', 1),
 ('tree climbing', 2)]

# Exercise:
### select all the authors who have written more than 1 million words, using GROUP BY and HAVING. Your results table should include the 'author' and their total word count as a 'total_words' column.

In [48]:
%%sql

CREATE TABLE books (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    author TEXT,
    title TEXT,
    words INTEGER);
    
INSERT INTO books (author, title, words)
    VALUES ("J.K. Rowling", "Harry Potter and the Philosopher's Stone", 79944);
INSERT INTO books (author, title, words)
    VALUES ("J.K. Rowling", "Harry Potter and the Chamber of Secrets", 85141);
INSERT INTO books (author, title, words)
    VALUES ("J.K. Rowling", "Harry Potter and the Prisoner of Azkaban", 107253);
INSERT INTO books (author, title, words)
    VALUES ("J.K. Rowling", "Harry Potter and the Goblet of Fire", 190637);
INSERT INTO books (author, title, words)
    VALUES ("J.K. Rowling", "Harry Potter and the Order of the Phoenix", 257045);
INSERT INTO books (author, title, words)
    VALUES ("J.K. Rowling", "Harry Potter and the Half-Blood Prince", 168923);
INSERT INTO books (author, title, words)
    VALUES ("J.K. Rowling", "Harry Potter and the Deathly Hallows", 197651);

INSERT INTO books (author, title, words)
    VALUES ("Stephenie Meyer", "Twilight", 118501);
INSERT INTO books (author, title, words)
    VALUES ("Stephenie Meyer", "New Moon", 132807);
INSERT INTO books (author, title, words)
    VALUES ("Stephenie Meyer", "Eclipse", 147930);
INSERT INTO books (author, title, words)
    VALUES ("Stephenie Meyer", "Breaking Dawn", 192196);
    
INSERT INTO books (author, title, words)
    VALUES ("J.R.R. Tolkien", "The Hobbit", 95022);
INSERT INTO books (author, title, words)
    VALUES ("J.R.R. Tolkien", "Fellowship of the Ring", 177227);
INSERT INTO books (author, title, words)
    VALUES ("J.R.R. Tolkien", "Two Towers", 143436);
INSERT INTO books (author, title, words)
    VALUES ("J.R.R. Tolkien", "Return of the King", 134462);

 * sqlite:///mydatabase.db
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [51]:
%%sql

select * from books
limit 5

 * sqlite:///mydatabase.db
Done.

[(1, 'J.K. Rowling', "Harry Potter and the Philosopher's Stone", 79944),
 (2, 'J.K. Rowling', 'Harry Potter and the Chamber of Secrets', 85141),
 (3, 'J.K. Rowling', 'Harry Potter and the Prisoner of Azkaban', 107253),
 (4, 'J.K. Rowling', 'Harry Potter and the Goblet of Fire', 190637),
 (5, 'J.K. Rowling', 'Harry Potter and the Order of the Phoenix', 257045)]

In [54]:
%%sql

select author, sum(words) as total_words
from books
group by author
Having total_words > 1000000

 * sqlite:///mydatabase.db
Done.

[('J.K. Rowling', 1086594)]

# Exercise:
### Select all the books with the name 'potter' in it.

In [60]:
%%sql

select author, title from books

Where title like '%otter%'

 * sqlite:///mydatabase.db
Done.

[('J.K. Rowling', "Harry Potter and the Philosopher's Stone"),
 ('J.K. Rowling', 'Harry Potter and the Chamber of Secrets'),
 ('J.K. Rowling', 'Harry Potter and the Prisoner of Azkaban'),
 ('J.K. Rowling', 'Harry Potter and the Goblet of Fire'),
 ('J.K. Rowling', 'Harry Potter and the Order of the Phoenix'),
 ('J.K. Rowling', 'Harry Potter and the Half-Blood Prince'),
 ('J.K. Rowling', 'Harry Potter and the Deathly Hallows')]

## Challenge: using the table below, display the count of how many students got grades A(>90), B(>80), C(>70) and F(<70).

In [61]:
%%sql

CREATE TABLE student_grades (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT,
    number_grade INTEGER,
    fraction_completed REAL);
    
INSERT INTO student_grades (name, number_grade, fraction_completed)
    VALUES ("Winston", 90, 0.805);
INSERT INTO student_grades (name, number_grade, fraction_completed)
    VALUES ("Winnefer", 95, 0.901);
INSERT INTO student_grades (name, number_grade, fraction_completed)
    VALUES ("Winsteen", 85, 0.906);
INSERT INTO student_grades (name, number_grade, fraction_completed)
    VALUES ("Wincifer", 66, 0.7054);
INSERT INTO student_grades (name, number_grade, fraction_completed)
    VALUES ("Winster", 76, 0.5013);
INSERT INTO student_grades (name, number_grade, fraction_completed)
    VALUES ("Winstonia", 82, 0.9045);

 * sqlite:///mydatabase.db
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.

[('Winston', 90, 81.0),
 ('Winnefer', 95, 90.0),
 ('Winsteen', 85, 91.0),
 ('Wincifer', 66, 71.0),
 ('Winster', 76, 50.0),
 ('Winstonia', 82, 90.0)]

In [71]:
%%sql
Select count(*),
CASE 
WHEN fraction_completed > 0.90 THEN 'A'
WHEN fraction_completed > 0.80 AND fraction_completed < 0.90 THEN 'B'
WHEN fraction_completed > 0.70 AND fraction_completed < 0.80 THEN 'C'
ELSE 'F' END as Grades

from student_grades

Group by Grades

 * sqlite:///mydatabase.db
Done.

[(3, 'A'), (1, 'B'), (1, 'C'), (1, 'F')]

## Demonstrate the use of joins on the table provided

In [76]:


%%sql

CREATE TABLE persons (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT,
    age INTEGER);
    
INSERT INTO persons (name, age) VALUES ("Bobby McBobbyFace", 12);
INSERT INTO persons (name, age) VALUES ("Lucy BoBucie", 25);
INSERT INTO persons (name, age) VALUES ("Banana FoFanna", 14);
INSERT INTO persons (name, age) VALUES ("Shish Kabob", 20);
INSERT INTO persons (name, age) VALUES ("Fluffy Sparkles", 8);

CREATE table hobbies (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    person_id INTEGER,
    name TEXT);
    
INSERT INTO hobbies (person_id, name) VALUES (1, "drawing");
INSERT INTO hobbies (person_id, name) VALUES (1, "coding");
INSERT INTO hobbies (person_id, name) VALUES (2, "dancing");
INSERT INTO hobbies (person_id, name) VALUES (2, "coding");
INSERT INTO hobbies (person_id, name) VALUES (3, "skating");
INSERT INTO hobbies (person_id, name) VALUES (3, "rowing");
INSERT INTO hobbies (person_id, name) VALUES (3, "drawing");
INSERT INTO hobbies (person_id, name) VALUES (4, "coding");
INSERT INTO hobbies (person_id, name) VALUES (4, "dilly-dallying");
INSERT INTO hobbies (person_id, name) VALUES (4, "meowing");

 * sqlite:///mydatabase.db
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [81]:
%%sql
select p.name, p.age, h.name as Hobbies
from persons as p
LEFT JOIN hobbies as h
ON p.id = h.person_id

 * sqlite:///mydatabase.db
Done.

[('Bobby McBobbyFace', 12, 'coding'),
 ('Bobby McBobbyFace', 12, 'drawing'),
 ('Lucy BoBucie', 25, 'coding'),
 ('Lucy BoBucie', 25, 'dancing'),
 ('Banana FoFanna', 14, 'drawing'),
 ('Banana FoFanna', 14, 'rowing'),
 ('Banana FoFanna', 14, 'skating'),
 ('Shish Kabob', 20, 'coding'),
 ('Shish Kabob', 20, 'dilly-dallying'),
 ('Shish Kabob', 20, 'meowing'),
 ('Fluffy Sparkles', 8, None)]

## In this notebook we have successfully demonstrated various logical operators (LIKE, AND, OR, =, <,>) along with aggregate functions like sum, max, min,avg along with group by , order by.

## we have also explored the use of CASE statements, various JOINS and UNION using SQL queries.